it/src/DataProcessors/РаспределениеЛицензий/РаспределениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеЛицензий</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаОстатков</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Закуплено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Установлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантРазмещения</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияЛицензий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаУстановлено</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРазмещено</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

it/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоСредства</name>
    <type>
      <types>CatalogRef.ВидыОсновногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/DataProcessors/РаспределениеЛицензий/Forms/ФормаИзмененияТабличнойЧасти/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//       

// Процедура помещает результаты подбора в хранилище
&НаСервере
Процедура ЗаписатьПодборВХранилище() 
	ПоместитьВоВременноеХранилище(ОсновныеСредства.Выгрузить(), АдресЛицензийДокумента);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация	= Параметры.Организация;
	ИдентификаторПрограммы = Параметры.ИдентификаторПрограммы;
	АдресЛицензийДокумента = Параметры.АдресЛицензийДокумента;
	ОсновныеСредства.Загрузить(ПолучитьИзВременногоХранилища(АдресЛицензийДокумента));
	
	Действие = "Установить лицензию по значению";
	
	//Установим вариант значения по умолчанию
	Для каждого Строка Из ОсновныеСредства Цикл
		Если ЗначениеЗаполнено(Строка.Лицензия) Тогда
			ВариантЗначения = Строка.Лицензия;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьПодбор();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьИзменение(Команда)
	
	Если ЗначениеЗаполнено(ВариантЗначения) И Действие = "Установить лицензию по значению" Тогда
	
		Для каждого Строка Из ОсновныеСредства Цикл
		
			Если Строка.Флаг Тогда
				
				Строка.Лицензия = ВариантЗначения;
				
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЕсли;		
			
КонецПроцедуры

&НаСервере
Процедура УстановитьТипВариантаЗначения()
	
	//ДоступныеОрганизации.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	
КонецПроцедуры	

&НаКлиенте
Процедура ДействиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Установить лицензию по значению");
	
	ЭлементСписка = ВыбратьИзСписка(СписокВыбора, Элементы.Действие, 1);
	Если ЭлементСписка <> Неопределено Тогда
		Действие = ЭлементСписка.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ИдентификаторПрограммы", ИдентификаторПрограммы);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаСпискаСОстатками", ПараметрыФормы, Элементы.ВариантЗначения, УникальныйИдентификатор);
		
КонецПроцедуры
